/*Задача: дневна печалба
Иван е програмист в американска компания и работи от вкъщи средно N дни в месеца, като изкарва средно по M долара на ден. В края на годината Иван получава бонус, който е равен на 2.5 месечни заплати. От спечеленото през годината му се удържат 25% данъци. Напишете програма, която да пресмята колко е чистата средна печалба на Иван на ден в лева, тъй като той харчи изкараното в България. Приема се, че в годината има точно 365 дни. Курсът на долара спрямо лева ще се чете от конзолата.

Входни данни
От конзолата се четат 3 числа:

На първия ред – работни дни в месеца. Цяло число в интервала [5 … 30].
На втория ред – изкарани пари на ден. Реално число в интервала [10.00 … 2000.00].
На третия ред – курсът на долара спрямо лева /1 долар = X лева/. Реално число в интервала [0.99 … 1.99].
Изходни данни
На конзолата да се отпечата 1 число – средната печалба на ден в лева. Резултатът да се форматира до втората цифра след десетичния знак.
 */


import java.util.Scanner;

public class dailyProfit {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int workDays = scanner.nextInt();
        double dayPay = scanner.nextDouble();
        double dollarCurse = scanner.nextDouble();

        double totalEarlyIncome = (workDays * dayPay ) * 12 + ((workDays * dayPay) * 2.5);
        totalEarlyIncome -= totalEarlyIncome * 0.25;


        System.out.printf("%.2f",totalEarlyIncome * dollarCurse / 365);








    }
}
