/*
Задача: парички
Преди време Пешо си е купил биткойни. Сега ще ходи на екскурзия из Европа и ще му трябва евро. Освен биткойни има и китайски юани. Пешо иска да обмени парите си в евро за екскурзията. Напишете програма, която да пресмята колко евро може да купи спрямо следните валутни курсове:

1 биткойн = 1168 лева.
1 китайски юан = 0.15 долара.
1 долар = 1.76 лева.
1 евро = 1.95 лева.
Обменното бюро има комисионна от 0 до 5 процента от крайната сума в евро.

Входни данни
От конзолата се четат 3 числа:

На първия ред – броят биткойни. Цяло число в интервала [0 … 20].
На втория ред – броят китайски юани. Реално число в интервала [0.00 … 50 000.00].
На третия ред – комисионната. Реално число в интервала [0.00 … 5.00].
Изходни данни
На конзолата да се отпечата 1 число - резултатът от обмяната на валутите. Не е нужно резултатът да се закръгля.
 */


import java.util.Scanner;

public class moneyConvertor {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int bitcoins = scanner.nextInt() * 1168;
        double chinaCash = (scanner.nextDouble() * 0.15) * 1.76;
        double commission = (scanner.nextDouble() ) /100;// ВИНАГИ КОГАТО ИМАШ НЕОПРЕДЕЛЕН ПРОЦЕНТ СЕ ДЕЛИ НА 100 !!

         double totalConvertedMoney = (chinaCash + bitcoins) / 1.95;
        System.out.println(totalConvertedMoney -= commission * totalConvertedMoney);


    }


}
